In [1]:
import pandas as pd
import numpy as np

# Series Exercises

1. **Create a Series:**
   - Create a Series named `fruits` with the data: 'apple', 'banana', 'cherry', 'date', and assign it an index of 'a', 'b', 'c', 'd' respectively.
   - Print the Series.
   - Print the `Index` of the series.

In [2]:
fruits = pd.Series(
    data = ["apple", "banana", "cherry", "date"], 
    index = ["a", "b", "c", "d"],
    name = "fruits")
fruits

a     apple
b    banana
c    cherry
d      date
Name: fruits, dtype: object

In [3]:
fruits.index

Index(['a', 'b', 'c', 'd'], dtype='object')

2. **Accessing Elements:**
   - Print the second  ("b") element of the `fruits` Series.

In [4]:
fruits["b"]

'banana'

3. **Series Operations:**
   - Create a Series with the squares of the numbers 1 through 5. 
   - Add 10 to each item in the series (hint: there a *method* to this madness).

In [5]:
series = pd.Series(
    data = np.arange(1, 6) ** 2
)
series = series.add(10)
series

0    11
1    14
2    19
3    26
4    35
dtype: int64

# DataFrame Exercises

1. **Create a DataFrame:**
   - Create a DataFrame named `students` with the columns: 'Name', 'Age', 'Grade'.
   - Populate it with data for three fictional students.

In [6]:
students = pd.DataFrame(
    data = {
        "Name": ["Alice", "Bob", "Carol"],
        "Age": [20, 21, 22],
        "Grade": ["A", "B", "C"]
    }
)
students

    Name  Age Grade
0  Alice   20     A
1    Bob   21     B
2  Carol   22     C

2. **Accessing Data:**
   - Print the `Name` column of the `students` DataFrame.

In [7]:
print(students.Name)

0    Alice
1      Bob
2    Carol
Name: Name, dtype: object

4. **DataFrame Operations:**
   
   - Add a new column to the `students` DataFrame named `Graduated`, which should be `True` if the student's grade is 'A' and `False` otherwise.
   - Print the updated DataFrame.

In [8]:
students["Graduated"] = students.Grade == "A"
students

    Name  Age Grade  Graduated
0  Alice   20     A       True
1    Bob   21     B      False
2  Carol   22     C      False

5. **Maths:**
   
   - Calculate and print the average age of the students.

In [9]:
students.filter(items = ["Age"]).aggregate(["mean"])

       Age
mean  21.0

   
6. **Sorting:**
   - Sort the `students` DataFrame based on the `Age` column in descending order and print it.

In [10]:
students.sort_values(by = "Age", ascending = False)

    Name  Age Grade  Graduated
2  Carol   22     C      False
1    Bob   21     B      False
0  Alice   20     A       True

7. **Tidy Data**.
   - Re-make the cognitive health data frame from class so it is "tidy", with each column as variable and each row an observation.
   - Compute the mean and standard deviation of all variables.
   - Compute the mean and standard error for the happiness variable (there might even be a method for computing standard error...).

In [11]:
cognitive = pd.DataFrame(
    data = {
        "happyness": [10, 15, 18, 13],
        "language": [2, 4, 7, 2],
        "energy": [5, 9, 12, 7],
        "memory": [3, 6, 9, 4]
    },
    index=["subject 1", "subject 2", "subject 3", "subject 4"]
)
cognitive

           happyness  language  energy  memory
subject 1         10         2       5       3
subject 2         15         4       9       6
subject 3         18         7      12       9
subject 4         13         2       7       4

In [12]:
cognitive.aggregate(["mean", "std"])

      happyness  language    energy    memory
mean  14.000000  3.750000  8.250000  5.500000
std    3.366502  2.362908  2.986079  2.645751

In [13]:
cognitive.filter(items = ["happyness"]).aggregate(["mean", "sem"])

      happyness
mean  14.000000
sem    1.683251